run/damBreakTemp/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  2.3.0                                 |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
 volScalarFieldValue alpha.water 0
 volScalarFieldValue T 270
 );

regions
(
 boxToCell
 {
 box (0 0 -1) (0.1461 0.292 1);
 fieldValues
 (
  volScalarFieldValue alpha.water 1
 );
 }

 boxToCell
 {
 box (0.2 0.3 -1) (0.3 0.4 1);
 fieldValues
 (
  volScalarFieldValue T 300
 );
 }

 );

// ************************************************************************* //
